Задание

Дорогие студенты!

К этому уроку очень простое, но важное для построения дальнейших уроков дополнительное задание.

Напишите ответы на вопросы в комментарий при сдаче практического задания:
1) Какие у вас ожидания от курса? Есть ли конкретные вопросы по теме Базы данных?
2) В какой сфере работаете сейчас?
3) Если в IT, то какой у вас опыт (инструменты, технологии, языки программирования)?

Ответ

Тема для меня новая и интересная, и, как я понял, очень важна в специальности, на которую я здесь учусь на факультете "Искусственный интеллект". По специальности я инженер-технолог в нефтегазовой отрасли и в связи с развитием направлений цифровизации и цифровой трансформации в моей отрасли, хотелось бы потихоньку пилить проект в данной сфере. Поэтому меня интересуют базы данных, которые используются для решения задач промышленных предприятий - нефтегазовых, химических, энергетических и др. производств. Опыта в IT мало, фактически вообще нет - работаю только в основном на уровне пользователя (продвинутого) со специализированным инженерным программным обеспечением, офисными приложениями, в т.ч. MS Excel с VBA... Остальная часть работы уже связана с технологическим оборудованием, химическими реагентами, технологическими процессами и т.д.